# +STARTUP: showall

* R2021 CURRICULUM
# +name: curriculum
{{{curriculum-table}}}
| <5> | <9>     | <50>                                                      | <6> | <5> | <5> | <5> | <5> | <5> | <5> |
|  No | Code    | Title                                                     | Cat | Hrs |   L |   T |   P |   E |   C |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Semester I*                                              |     |     |     |     |     |     |     |
|     |         | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 | UEN2176 | Technical English                                         | HS  |   4 |   2 |   0 |   2 |   0 |   3 |
|   2 | UMA2176 | Matrices and Calculus                                     | BS  |   4 |   3 |   1 |   0 |   0 |   4 |
|   3 | UPH2176 | Engineering Physics                                       | BS  |   3 |   3 |   0 |   0 |   0 |   3 |
|   4 | UCY2176 | Engineering Chemistry                                     | BS  |   3 |   3 |   0 |   0 |   0 |   3 |
|   5 | UGE2176 | Problem Solving and Programming in Python                 | ES  |   3 |   3 |   0 |   0 |   0 |   3 |
|   6 | UGE2177 | Engineering Graphics                                      | ES  |   5 |   1 |   0 |   4 |   0 |   3 |
|     |         | /Practical/                                               |     |     |     |     |     |     |     |
|   7 | UGS2197 | Physics and Chemistry Lab                                 | BS  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|   8 | UGE2197 | Programming in Python Lab                                 | ES  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | /Total/                                                   |     |  28 |  15 |   1 |  12 |   0 |  22 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Semester II*                                             |     |     |     |     |     |     |     |
|     |         | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 | UMA2276 | Complex Functions and Laplace Transforms                  | BS  |   4 |   3 |   1 |   0 |   0 |   4 |
|   2 | UEE2276 | Basic Electrical and Electronics Engineering              | ES  |   3 |   3 |   0 |   0 |   0 |   3 |
|   3 | UCS2201 | Fundamentals and Practice of Software Development (TCP b) | ES  |   8 |   2 |   0 |   3 |   3 | 4.5 |
|   4 | UCY2276 | Environmental Science                                     | BS  |   3 |   3 |   0 |   0 |   0 |   0 |
|   5 |         | Humanities Elective I                                     | HS  |   3 |   3 |   0 |   0 |   0 |   3 |
|   6 | UCS2202 | Foundations of Data Science                               | ES  |   3 |   3 |   0 |   0 |   0 |   3 |
|     |         | /Practical/                                               |     |     |     |     |     |     |     |
|   7 | UGE2297 | Design Thinking and Engineering Practices Lab             | ES  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | /Total/                                                   |     |  27 |  17 |   1 |   6 |   3 |  19 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Semester III*                                            |     |     |     |     |     |     |     |
|     |         | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 | UMA2377 | Discrete Mathematics                                      | BS  |   4 |   3 |   1 |   0 |   0 |   4 |
|   2 | UHS2351 | Universal Human Values II                                 | HS  |   3 |   3 |   0 |   0 |   0 |   3 |
|   3 | UCS2301 | Digital Principles and System Design                      | ES  |   3 |   3 |   0 |   0 |   0 |   3 |
|   4 | UCS2302 | Data Structures                                           | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   5 | UCS2303 | Object Oriented Programming                               | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|     |         | /Practical/                                               |     |     |     |     |     |     |     |
|   6 | UCS2311 | Digital Design Lab                                        | ES  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|   7 | UCS2312 | Data Structures Lab                                       | PC  |   4 |   0 |   0 |   4 |   0 |   2 |
|   8 | UCS2313 | Object Oriented Programming Lab                           | PC  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | /Total/                                                   |     |  26 |  15 |   1 |  10 |   0 |  21 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Semester IV*                                             |     |     |     |     |     |     |     |
|     |         | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 | UMA2455 | Probability and Statistical Methods                       | BS  |   4 |   3 |   1 |   0 |   0 |   4 |
|   2 | UHS2476 | Indian Constitution                                       | HS  |   3 |   3 |   0 |   0 |   0 |   0 |
|   3 | UCS2401 | Computer Organization and Architecture                    | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   4 | UCS2402 | Operating Systems                                         | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   5 | UCS2403 | Design and Analysis of Algorithms (TCP a)                 | PC  |   5 |   3 |   0 |   2 |   0 |   4 |
|   6 | UCS2404 | Database Management Systems                               | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|     |         | /Practical/                                               |     |     |     |     |     |     |     |
|   7 | UCS2412 | Operating Systems Lab                                     | PC  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|   8 | UCS2411 | Database Lab                                              | PC  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | /Total/                                                   |     |  27 |  18 |   1 |   8 |   0 |  20 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Semester V*                                              |     |     |     |     |     |     |     |
|     |         | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 | UCS2501 | Computer Networks                                         | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   2 | UCS2502 | Microprocessors, microcontrollers, and Interfacing        | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   3 | UCS2504 | Foundations of Artificial Intelligence (TCP a)            | PC  |   5 |   3 |   0 |   2 |   0 |   4 |
|   4 | UCS2503 | Software Engineering                                      | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   5 |         | Professional Elective I                                   | PE  |   3 |   3 |   0 |   0 |   0 |   3 |
|   6 |         | Management Elective                                       | HS  |   3 |   3 |   0 |   0 |   0 |   3 |
|     |         | /Practical/                                               |     |     |     |     |     |     |     |
|   7 | UCS2511 | Networks Lab                                              | PC  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|   8 | UCS2512 | Microprocessors Lab                                       | PC  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | /Total/                                                   |     |  26 |  18 |   0 |   8 |   0 |  22 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Semester VI*                                             |     |     |     |     |     |     |     |
|     |         | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 | UCS2601 | Internet Programming                                      | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   2 | UCS2602 | Software System Security                                  | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   3 | UCS2604 | Principles of Machine Learning                            | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   4 | UCS2603 | Theory of Computation                                     | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   5 |         | Professional Elective II                                  | PE  |   3 |   3 |   0 |   0 |   0 |   3 |
|   6 |         | Open Elective I                                           | OE  |   3 |   3 |   0 |   0 |   0 |   3 |
|     |         | /Practical/                                               |     |     |     |     |     |     |     |
|   7 | UCS2611 | Internet Programming Lab                                  | PC  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|   8 | UCS2612 | Machine Learning Lab                                      | PC  |   3 |   0 |   0 |   3 |   0 | 1.5 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | /Total/                                                   |     |  24 |  18 |   0 |   6 |   0 |  21 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Semester VII*                                            |     |     |     |     |     |     |     |
|     |         | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 | UCS2701 | Distributed Systems                                       | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   2 | UCS2703 | Software Architecture                                     | PC  |   3 |   3 |   0 |   0 |   0 |   3 |
|   3 | UCS2702 | Compiler Design (TCP a)                                   | PC  |   5 |   3 |   0 |   2 |   0 |   4 |
|   4 |         | Professional Elective III                                 | PE  |   3 |   3 |   0 |   0 |   0 |   3 |
|   5 |         | Professional Elective IV                                  | PE  |   3 |   3 |   0 |   0 |   0 |   3 |
|   6 |         | Professional Elective V                                   | PE  |   3 |   3 |   0 |   0 |   0 |   3 |
|     |         | /Practical/                                               |     |     |     |     |     |     |     |
|   7 | UCS2717 | Project Work Phase I                                      | EEC |   6 |   0 |   0 |   6 |   0 |   3 |
|   8 | UCS2716 | Industrial Training / Internship                          | EEC |   0 |   0 |   0 |   0 |   0 |   2 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | /Total/                                                   |     |  26 |  18 |   0 |   8 |   0 |  24 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Semester VIII*                                           |     |     |     |     |     |     |     |
|     |         | /Theory/                                                  |     |     |     |     |     |     |     |
|   1 |         | Professional Elective VI                                  | PE  |   3 |   3 |   0 |   0 |   0 |   3 |
|   2 |         | Open Elective II                                          | OE  |   3 |   3 |   0 |   0 |   0 |   3 |
|     |         | /Practical/                                               |     |     |     |     |     |     |     |
|   3 | UCS2818 | Project Work Phase II                                     | EEC |  16 |   0 |   0 |  16 |   0 |   8 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | Total                                                     |     |  22 |   6 |   0 |  16 |   0 |  14 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Grand Total*                                             |     |     |     |     |     |     | 163 |
|-----+---------+-----------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
#+TBLFM: @14$5..@14$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @25$5..@25$>=vsum(@-II+3..@-3)+vsum(@-1..@-1)
#+TBLFM: @37$5..@37$>=vsum(@-II+3..@-5)+vsum(@-3..@-1)
#+TBLFM: @49$5..@49$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @61$5..@61$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @73$5..@73$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @85$5..@85$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @92$5..@92$>=vsum(@-II+3..@-3)+vsum(@-1..@-1)
#+TBLFM: @93$10=@III+1+@IIIII+1+@IIIIIII+1+@IIIIIIIII+1+@IIIIIIIIIII+1+@IIIIIIIIIIIII+1+@IIIIIIIIIIIIIII+1+@IIIIIIIIIIIIIIIII+1;%3d

{{{clrpage}}}
** HUMANITIES ELECTIVES I
{{{curriculum-table}}}
| <5> | <9>     | <50>                                                 | <6> | <5> | <5> | <5> | <5> | <5> | <5> |
|  No | Code    | Title                                                | Cat | Hrs |   L |   T |   P |   E |   C |
|-----+---------+------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|   1 | UEN2241 | Language and Communication                           | HS  |   3 |   0 |   0 |   0 |   0 |   3 |
|   2 | UEN2242 | Fundamentals of Linguistics                          | HS  |   3 |   0 |   0 |   0 |   0 |   3 |
|   3 | UHS2243 | Film Appreciation                                    | HS  |   3 |   0 |   0 |   0 |   0 |   3 |
|   4 | UHS2241 | Human relations at Work                              | HS  |   3 |   0 |   0 |   0 |   0 |   3 |
|   5 | UHS2242 | Application of Psychology in Everyday Life           | HS  |   3 |   0 |   0 |   0 |   0 |   3 |
|   6 | UEN2243 | Understanding Society and Culture through Literature | HS  |   3 |   0 |   0 |   0 |   0 |   3 |
|-----+---------+------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|

** MANAGEMENT ELECTIVES
{{{curriculum-table}}}
| <5> | <9>     | <50>                                                        | <6> | <5> | <5> | <5> | <5> | <5> | <5> |
|  No | Code    | Title                                                       | Cat | Hrs |   L |   T |   P |   E |   C |
|-----+---------+-------------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|   1 | UBA2541 | Principles of Management                                    | HS  |   3 |   3 |   0 |   0 |   0 |   3 |
|   2 | UBA2542 | Total Quality Management                                    | HS  |   3 |   3 |   0 |   0 |   0 |   3 |
|   5 | UBA2543 | Work Ethics, Corporate Social Responsibility and Governance | HS  |   3 |   3 |   0 |   0 |   0 |   3 |
|   3 | UBA2545 | Operations Research                                         | HS  |   3 |   3 |   0 |   0 |   0 |   3 |
|   4 | UBA2544 | Organization Behaviour                                      | HS  |   3 |   3 |   0 |   0 |   0 |   3 |

{{{clrpage}}}
** PROFESSIONAL ELECTIVES
{{{curriculum-table}}}
| <5> | <9>     | <50>                                         | <6> | <5> | <5> | <5> | <5> | <5> | <5> |
|  No | Code    | Title                                        | Cat | Hrs |   L |   T |   P | E   |   C |
|-----+---------+----------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Professional Elective 1*                    |     |     |     |     |     |     |     |
|   1 | UMA2542 | Mathematics for Machine Learning [fn:1]      | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | UCS2521 | Big Data Technologies                        | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | UCS2522 | Software Testing                             | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | UCS2523 | Image Processing and Analysis                | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | UCS2524 | Logic Programming                            | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | UCS2525 | UNIX Internals                               | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | UCS2527 | Ethical Hacking and Tools                    | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   8 | UCS2526 | Advanced Database Management Systems         | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+---------+----------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Professional Elective 2*                    |     |     |     |     |     |     |     |
|   1 | UCS2621 | Cloud Computing                              | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | UCS2626 | Big Data Modeling and Management             | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | UCS2622 | Software Configuration Management            | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | UCS2623 | Probabilistic Graphical Models               | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | UCS2627 | Natural Language Processing and Applications | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | UCS2624 | Cyber Forensics                              | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | UCS2625 | IoT Technologies                             | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+---------+----------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Professional Elective 3*                    |     |     |     |     |     |     |     |
|   1 | UCS2721 | Bayesian Data Analysis                       | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | UCS2722 | Wireless and Adhoc Networks                  | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | UCS2723 | Object Oriented Analysis and Design          | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | UCS2724 | Soft Computing                               | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | UCS2725 | Deep Learning                                | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | UCS2726 | Multicore Architectures and Programming      | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | UCS2727 | Network and Server Security                  | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+---------+----------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Professional Elective 4*                    |     |     |     |     |     |     |     |
|   1 | UCS2739 | Healthcare Data Analytics                    | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | UCS2728 | User Experience Design                       | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | UCS2741 | Social Network Analysis and Applications     | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | UCS2735 | Principles of Reinforcement Learning         | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | UCS2729 | Blockchain Technologies                      | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | UCS2736 | Embedded Systems Design                      | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | UCS2742 | Graphics and Multimedia                      | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+---------+----------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Professional Elective 5*                    |     |     |     |     |     |     |     |
|   1 | UCS2743 | Business Intelligence                        | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | UCS2731 | Agile Methodologies                          | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | UCS2732 | Time Series Analysis and Forecasting         | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | UCS2737 | Computer Vision                              | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | UCS2738 | Speech Processing and Synthesis              | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | UCS2733 | Mobile Computing                             | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | UCS2734 | Mobile and Wireless Security                 | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+---------+----------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |         | *Professional Elective 6*                    |     |     |     |     |     |     |     |
|   1 | UCS2821 | Bioinformatics Technologies                  | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   2 | UCS2822 | Formal System Verification                   | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   3 | UCS2823 | Service Oriented Architecture                | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   4 | UCS2824 | Information Retrieval Techniques             | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   5 | UCS2825 | Introduction to Robotics                     | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   6 | UCS2827 | Software Defined Networking                  | PE  |   3 |   3 |   0 |   0 |     |   3 |
|   7 | UCS2826 | Parallel Algorithms                          | PE  |   3 |   3 |   0 |   0 |     |   3 |
|-----+---------+----------------------------------------------+-----+-----+-----+-----+-----+-----+-----|
[fn:1] Only for students of Honours degree


** OPEN ELECTIVES OFFERED BY CSE (TO OTHER DEPARTMENTS)
{{{curriculum-table}}}
| <5> | <9>  | <50>                                   | <6> | <5> | <5> | <5> | <5> | <5> | <5> |
|  No | Code | Title                                  | Cat | Hrs |   L |   T |   P | E   |   C |
|-----+------+----------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Open Electives 1 (Semester VI)*       |     |     |     |     |     |     |     |
|   1 | OE1  | Introduction to Data Structures        | OE  |   4 |   2 |   0 |   2 |     |   3 |
|   2 | OE2  | Object Oriented Programming Techniques | OE  |   4 |   2 |   0 |   2 |     |   3 |
|   3 | OE3  | Problem Solving and Programming in C   | OE  |   4 |   2 |   0 |   2 |     |   3 |
|-----+------+----------------------------------------+-----+-----+-----+-----+-----+-----+-----|
|     |      | *Open Electives 2 (Semester VIII)*     |     |     |     |     |     |     |     |
|   4 | OE4  | Introduction to Big Data Analytics     | OE  |   4 |   2 |   0 |   2 |     |   3 |
|   5 | OE5  | Machine Learning Applications          | OE  |   4 |   2 |   0 |   2 |     |   3 |
|   6 | OE6  | Web Technology                         | OE  |   4 |   2 |   0 |   2 |     |   3 |
|-----+------+----------------------------------------+-----+-----+-----+-----+-----+-----+-----|
All open electives are Theory-cum-Practical (Lab-integrated Theory).

* SPECIALIZATION
{{{specialization-table}}}
| <10> | <30>                                                      | <30>                                                                  | <30>                                                                                    |
|   PE | /Software Engineering/                                    | /Systems and Security/                                                | /AI and Machine Learning/                                                               |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    1 | Big Data Technologies, Software Testing                   | UNIX Internals, Ethical Hacking                                       | Mathematics for Machine Learning, Image Processing and Analysis, Logic Programming      |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    2 | Big Data Management, Software Configuration Management    | Cloud Computing, Cyber Forensics, Internet of Things                  | Probabilistic Graphical Models, Natural Language Processing                              |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    3 | Object Oriented Analysis and Design                       | Multicore Architectures and Programming, Network and Server Security | Bayesian Data Analysis, Soft Computing, Deep Learning                                   |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    4 | User Experience Design                                    | Blockchain Technologies, Embedded systems                             | Social Network Analysis, Reinforcement Learning                                         |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    5 | Agile Methodologies                                       | Mobile Computing, Mobile and Wireless Security                        | Time Series Analysis and Forecasting, Computer Vision, Speech Processing and Synthesis  |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
|    6 | Formal System Verification, Service Oriented Architecture | Software Defined Networks                                             | Bioinformatics Technologies, Information Retrieval Techniques, Introduction to Robotics |
|------+-----------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
